import json

breakfastFoods = {u"شيرکاکائو+کره+عسل+نان": [33], u"پنير + تخم مرغ + نان": [36], u"شير + كره + مربا + نان": [22],
                  u"پنير + حلوا شکري + نان": [70], u"تخم مرغ 2 عدد + نان": [156], u"شير+پنير+نان": [76],
                  u"شيركاكائو + كره + مربا + نان ": [89],
                  u"پنير+كره+عسل + نان ": [168],
                  u"شير+تخم مرغ +نان": [79],
                  u"پنير + گردو + نان": [37],
                  u"خامه شکلاتي + نان":[34]}

lunchFoods = {u"زرشك پلو با مرغ با ماست یک نفره": [132], u"لوبيا پلو با گوشت  با ماست تك نفره": [43,166,167],
              u"خوراك ماكاروني با ترشي": [15], u"چلو خورشت قيمه با ماست تك نفره": [134,135,136,41,147,148],
              u"چلو کباب کوبيده و گوجه  با دوغ": [87,137,139],
              u"استامبولي پلو با گوشت  با ماست تک نفره": [104,17,105], u"چلو خورشت بادمجان  با ماست تك نفره": [123,124,125],
              u"پلو سبزيجات  با ماست موسیر": [108,31,109], u"چلو خورشت سبزي  با ماست و موسير": [128,129,130],
              u"سبزي پلو با ماهي قزل آلا با ترشی": [140,141,142], u"كلم پلو  با ترشي": [159,29,160,29],
              u"چلو جوجه كباب  با حلوا ":[120,121,122]
}

dinnerFoods = {u"خوراك كتلت با آش ماست و سس تک نفره": [28], u"چلو خورشت سبزي  با ترشي": [128,129,130],
               u"خوراك مرغ با سوپ ورميشل و خيارشور - پاخوراكي": [11,26],
               u"استامبولي پلو با گوشت با ماست تك نفره": [104,17,105], u"خوراک تخم مرغ و پنير": [60],
               u"عدس پلو با مرغ با ماست تك نفره  ": [161,30], u"خوراک دو پيازه تن ماهي با جو": [64],
               u"چلو جوجه كباب با ماست تك نفره": [121,120,122], u"خوراك ماكاروني با ماست تک نفره": [15],
               u"خوراك كشك و بادمجان با آش رشته": [32],
               u"خوراك حليم بادمجان با سوپ جو ":[45],
               u"خوراک کوکو سبري با آش رشته و گوجه فرنگي-پاخوراكي ":[42],
               u"چلو خورشت فسنجان با ماست تك نفره":[88],
               u"خوراك دلمه با آش رشته و گوجه فرنگي-پاخوراكي":[188],
                u"سبزي پلو با ماهي قزل آلا با ترشی": [140,141,142],
               u"خوراك كوكو سيب زميني با آش رشته و گوجه فرنگي":[46]

}
restaurants = [u"این وعده را نمی خوام", u"ارم", u"دانشکده هنر و معماری", u"خوابگاه شهيد دستغيب", u"دانشكده علوم",
               u"دانشكده مهندسي نفت و گاز", u"مركزي", u"دانشكده كشاورزي", u"دانشكده دامپزشكي", u"خوابگاه دامپزشكي"]

restMapping = ["", "3", "4", "5", "6", "7", "8", "9", "10", "17"]

json_python = {}
json_python["version"]= 1
json_python['breakfastFoods'] = breakfastFoods
json_python['lunchFoods'] = lunchFoods
json_python['dinnerFoods'] = dinnerFoods
json_python['restaurants']=restaurants
json_python['restMapping']=restMapping

json_file = json.dumps(json_python)
file = open('./data/_formdata', 'w')
file.write(json_file)  # write database to file
